Revit 2027 API
BuiltInFailures.StairRampFailures.StairsActualRunWidthLessThanMinimumFailure Property
 Actual run width is less than minimum run width defined in stairs type.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId StairsActualRunWidthLessThanMinimumFailure { get; }
Public Shared ReadOnly Property StairsActualRunWidthLessThanMinimumFailure As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ StairsActualRunWidthLessThanMinimumFailure {
	FailureDefinitionId^ get ();
}
static member StairsActualRunWidthLessThanMinimumFailure : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.StairRampFailures Class
Autodesk.Revit.DB Namespace